{
   "irVersion":"3",
   "producerName":"CNTK",
   "producerVersion":"2.5.1",
   "domain":"ai.cntk",
   "modelVersion":"1",
   "graph":{
      "node":[
         {
            "input":[
               "Parameter193",
               "Parameter193_reshape1_shape"
            ],
            "output":[
               "Parameter193_reshape1"
            ],
            "name":"Times212_reshape1",
            "opType":"Reshape"
         },
         {
            "input":[
               "Input3",
               "Parameter5"
            ],
            "output":[
               "Convolution28_Output_0"
            ],
            "name":"Convolution28",
            "opType":"Conv",
            "attribute":[
               {
                  "name":"kernel_shape",
                  "ints":[
                     "5",
                     "5"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"strides",
                  "ints":[
                     "1",
                     "1"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"auto_pad",
                  "s":"U0FNRV9VUFBFUg==",
                  "type":"STRING"
               },
               {
                  "name":"group",
                  "i":"1",
                  "type":"INT"
               },
               {
                  "name":"dilations",
                  "ints":[
                     "1",
                     "1"
                  ],
                  "type":"INTS"
               }
            ]
         },
         {
            "input":[
               "Convolution28_Output_0",
               "Parameter6"
            ],
            "output":[
               "Plus30_Output_0"
            ],
            "name":"Plus30",
            "opType":"Add"
         },
         {
            "input":[
               "Plus30_Output_0"
            ],
            "output":[
               "ReLU32_Output_0"
            ],
            "name":"ReLU32",
            "opType":"Relu"
         },
         {
            "input":[
               "ReLU32_Output_0"
            ],
            "output":[
               "Pooling66_Output_0"
            ],
            "name":"Pooling66",
            "opType":"MaxPool",
            "attribute":[
               {
                  "name":"kernel_shape",
                  "ints":[
                     "3",
                     "3"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"strides",
                  "ints":[
                     "3",
                     "3"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"pads",
                  "ints":[
                     "0",
                     "0",
                     "0",
                     "0"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"auto_pad",
                  "s":"Tk9UU0VU",
                  "type":"STRING"
               }
            ]
         },
         {
            "input":[
               "Pooling66_Output_0",
               "Parameter87"
            ],
            "output":[
               "Convolution110_Output_0"
            ],
            "name":"Convolution110",
            "opType":"Conv",
            "attribute":[
               {
                  "name":"kernel_shape",
                  "ints":[
                     "5",
                     "5"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"strides",
                  "ints":[
                     "1",
                     "1"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"auto_pad",
                  "s":"U0FNRV9VUFBFUg==",
                  "type":"STRING"
               },
               {
                  "name":"group",
                  "i":"1",
                  "type":"INT"
               },
               {
                  "name":"dilations",
                  "ints":[
                     "1",
                     "1"
                  ],
                  "type":"INTS"
               }
            ]
         },
         {
            "input":[
               "Convolution110_Output_0",
               "Parameter88"
            ],
            "output":[
               "Plus112_Output_0"
            ],
            "name":"Plus112",
            "opType":"Add"
         },
         {
            "input":[
               "Plus112_Output_0"
            ],
            "output":[
               "ReLU114_Output_0"
            ],
            "name":"ReLU114",
            "opType":"Relu"
         },
         {
            "input":[
               "ReLU114_Output_0"
            ],
            "output":[
               "Pooling160_Output_0"
            ],
            "name":"Pooling160",
            "opType":"MaxPool",
            "attribute":[
               {
                  "name":"kernel_shape",
                  "ints":[
                     "3",
                     "3"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"strides",
                  "ints":[
                     "3",
                     "3"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"pads",
                  "ints":[
                     "0",
                     "0",
                     "0",
                     "0"
                  ],
                  "type":"INTS"
               },
               {
                  "name":"auto_pad",
                  "s":"Tk9UU0VU",
                  "type":"STRING"
               }
            ]
         },
         {
            "input":[
               "Pooling160_Output_0",
               "Pooling160_Output_0_reshape0_shape"
            ],
            "output":[
               "Pooling160_Output_0_reshape0"
            ],
            "name":"Times212_reshape0",
            "opType":"Reshape"
         },
         {
            "input":[
               "Pooling160_Output_0_reshape0",
               "Parameter193_reshape1"
            ],
            "output":[
               "Times212_Output_0"
            ],
            "name":"Times212",
            "opType":"MatMul"
         },
         {
            "input":[
               "Times212_Output_0",
               "Parameter194"
            ],
            "output":[
               "Plus214_Output_0"
            ],
            "name":"Plus214",
            "opType":"Add"
         }
      ],
      "name":"CNTKGraph",
      "initializer":[
         {
            "dims":[
               "16",
               "4",
               "4",
               "10"
            ],
            "dataType":1,
            "floatData":[
               0.09163288,
               0.1214359,
               0.08535065,
               0.122606859,
               -0.0987539738,
               -0.112124488,
               -0.035732843,
               -0.09626211,
               -0.147887319,
               0.03485894,
               -0.0484465249,
               0.136892632,
               0.1460547,
               -0.119769312,
               0.208040535,
               -0.2271333,
               0.4233359,
               0.058677204,
               -0.167315915,
               -0.37082842,
               -0.19223924,
               0.09432013,
               0.0936918,
               -0.0104355607,
               0.23059231,
               -0.4524573,
               0.00250081369,
               -0.0124352779,
               0.0317781866,
               -0.304293126,
               0.01802597,
               0.0242814869,
               0.287353,
               0.170990467,
               -0.07439459,
               0.0176675227,
               -0.105357632,
               -0.08181137,
               0.0598792844,
               0.0004734896,
               -0.153508037,
               0.120629221,
               0.107659891,
               0.09445933,
               -0.06985045,
               -0.02568338,
               0.109131157,
               -0.08317744,
               0.0825790539,
               -0.175707862,
               -0.168167844,
               0.105139866,
               -0.17431362,
               -0.08228223,
               0.464749247,
               0.0302605852,
               -0.159338862,
               0.199582711,
               -0.101042688,
               -0.494540751,
               0.329589069,
               0.177509815,
               0.4113831,
               0.1232613,
               -0.275756747,
               -0.4662941,
               -0.3712764,
               -0.0209946018,
               -0.12800093,
               0.04856027,
               0.381666064,
               -0.23197861,
               0.407883525,
               0.0226583127,
               0.07786204,
               -0.670184255,
               -0.061176125,
               0.0467672274,
               -0.0329380743,
               0.142247826,
               -0.12855503,
               0.0259743482,
               -0.008957884,
               0.179392055,
               -0.03346034,
               -0.0271584,
               0.130296335,
               -0.0454923734,
               0.05367948,
               0.0218497068,
               -0.005965759,
               -0.0496672839,
               -0.158913776,
               0.108843282,
               -0.1700662,
               0.349572718,
               -0.174302235,
               0.165478885,
               -0.140370116,
               -0.17373389,
               -0.036601726,
               0.0401035547,
               0.191957369,
               0.0425166376,
               -0.163825363,
               0.441913456,
               0.07696633,
               -0.437642664,
               0.04947806,
               -0.235769913,
               -0.09825645,
               -0.4054715,
               -0.373022079,
               0.243689433,
               -0.5215958,
               0.5668888,
               0.5552223,
               -0.104429565,
               0.180027723,
               -0.113761075,
               -0.0396500155,
               -0.112143181,
               -0.00237031118,
               -0.00314400462,
               -0.102768116,
               0.0190406777,
               -0.0721415654,
               -0.06295154,
               0.08691363,
               0.05952634,
               0.180385888,
               0.107878976,
               -0.196015969,
               0.008016468,
               0.06330039,
               0.01480228,
               -0.07189274,
               0.106876738,
               -0.24504678,
               0.0152521133,
               -0.33518225,
               -0.03278789,
               -0.1590716,
               0.58422935,
               -0.07350886,
               0.515739,
               0.161142915,
               -0.200411439,
               0.0861108154,
               -0.266738027,
               -0.482520729,
               0.0404598154,
               -0.02588378,
               0.2995097,
               -0.217644766,
               0.08116388,
               0.266560346,
               -0.290178776,
               0.266598374,
               -0.203051567,
               -0.124297671,
               0.00596541958,
               0.2243628,
               0.136541039,
               -0.0280273687,
               -0.280918777,
               0.022815384,
               0.06510894,
               -0.146041542,
               0.102123775,
               -0.137249559,
               0.056102585,
               -0.08111744,
               0.00711206533,
               -0.206687912,
               0.1132005,
               -0.18013525,
               0.359819233,
               -0.2298141,
               0.00777494675,
               -0.212653637,
               -0.1025082,
               0.0910964,
               0.271351844,
               -0.145043716,
               0.087233305,
               -0.07021253,
               0.135834634,
               0.117574222,
               -0.006081803,
               -0.03857495,
               0.08597721,
               0.0474117249,
               -0.03664012,
               0.0816631,
               0.08421722,
               0.134744078,
               -0.06303027,
               0.0055456385,
               0.0772921,
               -0.0240220986,
               -0.07385796,
               0.242662415,
               0.2002832,
               -0.1275244,
               -0.375825,
               -0.25733465,
               0.1702445,
               -0.0727194846,
               -0.000426710758,
               -0.0350637957,
               0.2522885,
               0.2963089,
               0.176915064,
               -0.407115459,
               -0.179246664,
               -0.486877382,
               0.7461554,
               -0.0434867069,
               -0.04073134,
               0.0566060469,
               -0.283466518,
               0.06753943,
               -0.274777234,
               -0.29532,
               0.319453746,
               -0.09977182,
               0.3588999,
               -0.137106627,
               -0.06071628,
               0.0891886055,
               -0.123899534,
               -0.4814082,
               -0.120985985,
               -0.07548032,
               0.50706,
               0.1617055,
               0.0334606729,
               -0.0129514188,
               0.109995022,
               -0.181182325,
               -0.20907186,
               0.170701176,
               0.208456248,
               0.103941783,
               0.164942324,
               -0.0519412346,
               0.297820926,
               -0.119817629,
               -0.1772886,
               -0.142602712,
               -0.00290327868,
               -0.156933352,
               -0.0611810461,
               0.183680624,
               0.273720175,
               -0.0901015848,
               -0.118381433,
               0.0272545945,
               0.334325,
               -0.144305319,
               -0.288838536,
               -0.2550128,
               -0.09727652,
               0.5777706,
               -0.291290045,
               0.185727537,
               -0.2331863,
               0.181666315,
               -0.0103724655,
               -0.0381526425,
               -0.08915569,
               0.646583855,
               0.1674061,
               0.126802072,
               -0.09792721,
               0.21416533,
               0.264532268,
               0.0538681932,
               -0.759514332,
               -0.2029055,
               0.348342,
               -0.137469158,
               0.2868602,
               0.214779943,
               0.09853071,
               -0.240420192,
               0.159541741,
               -0.226771012,
               0.0171609763,
               0.0113993026,
               0.175189853,
               0.04992486,
               0.0774332061,
               -0.045792,
               0.024458969,
               -0.0514438376,
               -0.48874712,
               -0.06580488,
               0.10073553,
               0.26834318,
               -0.0398233235,
               0.09793092,
               -0.0395916663,
               -0.07608389,
               -0.000104266968,
               0.0326866,
               -0.31194073,
               0.08907616,
               -0.289730459,
               -0.0789951,
               0.248337165,
               0.655972064,
               -0.289599419,
               0.346340179,
               -0.4276049,
               -0.06253678,
               0.0413991734,
               -0.09482404,
               -0.14266187,
               0.0364593044,
               -0.131768659,
               0.0112982942,
               -0.0419465676,
               -0.0253559817,
               -0.177284271,
               0.0487115346,
               0.007119633,
               -0.0351505578,
               -0.120652772,
               0.03831062,
               -0.196701854,
               0.15221554,
               0.06654548,
               0.0266434979,
               -0.182234079,
               -0.200743675,
               0.247634679,
               0.1427248,
               -0.0126292054,
               0.126018673,
               -0.0181525461,
               -0.0115782851,
               0.113744,
               -0.3333826,
               -0.131094515,
               -0.14465189,
               0.218756869,
               0.2894058,
               0.2500842,
               0.173967987,
               0.101970777,
               -0.256145179,
               -0.112037033,
               -0.0591312945,
               0.0352073051,
               -0.0408237837,
               -0.08840141,
               -0.0174993668,
               0.0350329131,
               -0.103432752,
               0.06942394,
               0.28200978,
               0.06655175,
               -0.166502059,
               0.06617831,
               -0.164538547,
               0.408509344,
               0.0625969246,
               -0.06361491,
               -0.2838924,
               0.183133155,
               0.4944689,
               0.2967484,
               -0.271681517,
               -0.00765815238,
               -0.49666068,
               0.343237966,
               0.09508498,
               -0.277070731,
               0.1930935,
               -0.243123308,
               0.222898439,
               0.180622712,
               -0.340442121,
               0.0245974641,
               -0.120146126,
               0.333555669,
               -0.237996578,
               0.0306914654,
               0.0208517052,
               -0.0576405935,
               -0.0124111073,
               -0.253740251,
               -0.337107033,
               0.497321248,
               0.4041796,
               0.0225259122,
               -0.223723367,
               0.00198901375,
               -0.318995446,
               0.0298700836,
               0.17537035,
               0.214423925,
               0.2671063,
               0.109519936,
               -0.283083022,
               0.327676117,
               0.2755309,
               -0.377097636,
               -0.6742046,
               -0.424232841,
               -0.175664321,
               0.222078443,
               0.5258628,
               0.498521119,
               -0.734213769,
               -0.07246285,
               -0.03177037,
               0.6141103,
               0.2753043,
               -0.181570634,
               0.0107922833,
               0.2778345,
               0.0486528873,
               0.191943929,
               -0.1422531,
               0.09415337,
               -0.142211959,
               -0.0477588922,
               0.138186619,
               0.113774344,
               -0.002222309,
               0.0121429954,
               -0.128018409,
               0.210845068,
               0.09857626,
               -0.007353052,
               -0.0913769,
               -0.186092,
               0.09367707,
               0.219868645,
               0.0137819927,
               0.0185393561,
               0.100219041,
               0.0575051,
               0.08740149,
               -0.2591946,
               0.051177077,
               0.0316201933,
               0.07561399,
               -0.215515152,
               -0.184999064,
               0.269176334,
               -0.232291445,
               0.240110755,
               0.2137433,
               -0.5332349,
               -0.07875639,
               0.211775988,
               0.170553043,
               0.5362649,
               -0.199513987,
               -0.005656009,
               -0.195226178,
               -0.124023683,
               0.06757839,
               -0.121892326,
               0.05454839,
               -0.301036865,
               -0.0005489599,
               0.171503544,
               0.770247638,
               -0.27090162,
               0.0589123555,
               -0.143505231,
               -0.0235970542,
               -0.0222502332,
               -0.234051734,
               -0.2757639,
               0.100744583,
               -0.132979631,
               -0.1356852,
               0.150511816,
               0.135899872,
               -0.083647944,
               0.143349,
               0.108986296,
               -0.109576769,
               0.004637918,
               0.0821246,
               -0.0569790266,
               -0.03259952,
               0.166973859,
               -0.11660593,
               0.130341113,
               0.1159108,
               0.08402854,
               -0.1398447,
               -0.00433913246,
               -0.07553751,
               0.07529408,
               0.146202356,
               -0.07316115,
               -0.1649327,
               -0.04817352,
               0.114243254,
               -0.165611669,
               -0.09932099,
               -0.17314133,
               0.0980626643,
               0.0523512959,
               0.03586894,
               0.000257904845,
               -0.110364154,
               0.07944494,
               -0.0142525034,
               0.04474987,
               -0.09602937,
               -0.06515513,
               0.0186606646,
               0.105786785,
               0.112245552,
               0.173224315,
               -0.0655655041,
               0.0322078057,
               0.0661569759,
               -0.102996364,
               -0.0456230231,
               -0.0907797441,
               0.0854920447,
               -0.06881946,
               0.3297488,
               -0.138026923,
               -0.06297126,
               0.172026828,
               -0.0575602576,
               -0.1393673,
               -0.2783894,
               -0.0036408226,
               -0.168498665,
               0.400883973,
               0.105272673,
               -0.0300565418,
               -0.3140541,
               -0.00655910326,
               -0.0188967586,
               -0.0230978634,
               -0.207946911,
               0.1163993,
               -0.04596498,
               0.121452928,
               0.118011914,
               0.3572183,
               -0.188513219,
               -0.132709578,
               0.216019213,
               -0.07118418,
               -0.0602787025,
               -0.014308637,
               0.0980960652,
               -0.108073354,
               0.030968409,
               -0.0976092741,
               0.0249960851,
               -0.241018981,
               0.0273502488,
               0.002106643,
               0.119291663,
               0.09693683,
               0.319007874,
               -0.166200384,
               0.163914979,
               -0.24900873,
               0.0323871337,
               0.09503581,
               0.06371842,
               0.3932006,
               -0.3992522,
               -0.18966803,
               -0.243474215,
               0.372648627,
               -0.353354216,
               0.005322188,
               -0.04494558,
               0.0584812872,
               -0.262204766,
               -0.05913911,
               -0.3559878,
               0.206965685,
               0.270226181,
               0.2154869,
               -0.357422054,
               -0.008915886,
               -0.399029225,
               0.0137153128,
               0.026476033,
               0.142181635,
               -0.202520087,
               0.278637648,
               -0.000417955278,
               -0.192497462,
               0.158933073,
               -0.0231078751,
               0.0281472933,
               0.116531104,
               -0.0178961512,
               -0.05649587,
               -0.08003104,
               -0.07378257,
               -0.103591561,
               0.0426709428,
               0.345543027,
               -0.355486721,
               0.0645467862,
               -0.09280721,
               0.116241477,
               0.214428484,
               0.287830323,
               -0.36001426,
               -0.31429404,
               0.08799483,
               -0.403667271,
               0.0492858849,
               0.260438323,
               -0.04560538,
               -0.08510876,
               0.384910256,
               0.2517859,
               0.0300664753,
               -0.191479683,
               0.0104601793,
               -0.164272234,
               0.101340696,
               0.07430271,
               0.07157307,
               -0.134038255,
               -0.191744715,
               0.00458582165,
               0.0129363351,
               -0.0165133588,
               0.00272558886,
               -0.009124319,
               0.115110591,
               0.0685053244,
               -0.103431076,
               0.116192915,
               0.0151742166,
               0.0275119226,
               -0.0294672884,
               0.08782141,
               0.170255467,
               -0.106536575,
               -0.115978062,
               -0.138294861,
               -0.0126407687,
               0.104214326,
               -0.07220742,
               0.04269384,
               0.0828627,
               0.0169750564,
               0.2577604,
               -0.110460632,
               -0.1426811,
               0.08814548,
               0.230498731,
               -0.04031062,
               -0.07507095,
               -0.315773427,
               -0.0223113168,
               -0.144335374,
               -0.07252429,
               -0.158364758,
               -0.157571957,
               -0.0663643256,
               0.3540959,
               0.00686871633,
               0.0377963223,
               -0.280330241,
               0.0186793935,
               0.0206664577,
               0.06874176,
               0.2016604,
               0.09627378,
               -0.118002616,
               0.1203466,
               -0.0172643214,
               0.0506760031,
               0.109200567,
               -0.0425657,
               -0.0281892251,
               0.222060323,
               0.130200535,
               -0.0527515747,
               0.124635249,
               0.086308524,
               0.04955891,
               0.19407317,
               -0.3270353,
               -0.205312088,
               -0.238266945,
               -0.276909173,
               0.06095132,
               0.195077524,
               0.0796512142,
               -0.1478825,
               -0.2017786,
               -0.0786117241,
               -0.0211253259,
               0.622372746,
               -0.127968848,
               -0.09095204,
               -0.10552834,
               0.290631622,
               -0.0561403967,
               0.0579045936,
               -0.08286869,
               0.0193896946,
               0.339653134,
               -0.04152262,
               -0.174899861,
               0.13207005,
               -0.0145694,
               -0.117743336,
               0.06858433,
               -0.042672,
               0.141760856,
               0.06368128,
               -0.1924913,
               -0.113412425,
               -0.01210175,
               0.107206024,
               0.3018728,
               -0.124819644,
               -0.03679987,
               0.293040842,
               -0.2622757,
               -0.0536270961,
               -0.08497927,
               0.121520713,
               -0.007846342,
               -0.29597494,
               0.0816249251,
               0.384330839,
               0.08779432,
               0.06559973,
               0.147280931,
               0.125339374,
               -0.05561045,
               0.251642317,
               -0.00153434812,
               -0.1802928,
               -0.164642528,
               -0.117555164,
               -0.11583522,
               -0.107091509,
               0.1661853,
               0.0887948945,
               0.1146164,
               -0.193600252,
               -0.1514248,
               0.0559892431,
               0.135939449,
               -0.03091767,
               -0.0123824151,
               0.08237934,
               0.06515523,
               -0.0597178563,
               -0.149126768,
               0.128917575,
               0.244185954,
               -0.167597115,
               0.08927612,
               0.03573741,
               -0.08931894,
               -0.00287343166,
               -0.1340703,
               -0.2309364,
               0.0390587077,
               -0.167248175,
               0.17862305,
               -0.09433726,
               -0.0187767558,
               0.137037963,
               -0.3222626,
               0.217611015,
               0.331986248,
               -0.4756216,
               0.4475462,
               -0.30787164,
               -0.152693823,
               0.182179466,
               -0.08886113,
               0.165065333,
               0.0415416434,
               0.182644859,
               0.00286571262,
               -0.304662675,
               0.150937214,
               -0.067663,
               -0.166773111,
               -0.137675121,
               0.0870079547,
               -0.0404420979,
               -0.03698462,
               -0.1809245,
               0.04105096,
               0.124303043,
               -0.04239628,
               -0.06371389,
               -0.135632947,
               0.09007594,
               0.14395377,
               0.196905658,
               -0.0303414073,
               0.0456840023,
               0.06577257,
               -0.04724097,
               0.08911956,
               0.04035165,
               -0.0522740372,
               -0.155778348,
               0.192288578,
               0.135431379,
               -0.0117495768,
               0.06312236,
               -0.0275140218,
               0.0196905844,
               -0.07631327,
               0.04084413,
               -0.0336445272,
               -0.07004954,
               -0.04987197,
               -0.147422537,
               0.0504842773,
               -0.0151304677,
               0.108181156,
               0.09920626,
               -0.136594355,
               -0.0405143127,
               -0.09093411,
               0.2356915,
               -0.259678662,
               -0.0443886928,
               0.0288310759,
               0.0517607555,
               0.00388930342,
               0.156902909,
               0.101290688,
               -0.20741795,
               -0.09403233,
               0.254923135,
               -0.151593879,
               -0.378086984,
               0.149543449,
               0.10286098,
               -0.218112662,
               -0.000876877166,
               -0.11623913,
               0.09086019,
               0.531831443,
               0.184823424,
               0.1546531,
               -0.07699968,
               0.0757132247,
               0.239942953,
               -0.451641828,
               0.00204828219,
               -0.398113549,
               -0.130661368,
               -0.0249895584,
               0.06897786,
               -0.0415934958,
               0.0656648055,
               -0.0634617358,
               0.0468063019,
               -0.0125538185,
               -0.115769595,
               -0.233194977,
               -0.276801974,
               -0.0136308027,
               -0.292408526,
               -0.402077317,
               -0.366942883,
               0.336439073,
               -0.05036816,
               -0.041783087,
               -0.259967983,
               0.299792379,
               0.438018024,
               0.0596868619,
               -0.00790510047,
               -0.3814732,
               -0.21906282,
               0.251765043,
               0.173696488,
               -0.17449452,
               -0.154688373,
               0.180831656,
               0.357748926,
               -0.0437999,
               0.37145716,
               -0.4525376,
               0.187282518,
               -0.013136982,
               -0.142992869,
               -0.5754454,
               -0.129227266,
               0.173299208,
               0.382660717,
               0.153348863,
               -0.159472689,
               0.0370973833,
               -0.0173440352,
               -0.03451868,
               -0.1748344,
               0.109003417,
               0.07499719,
               0.1522145,
               -0.04126246,
               0.0677759349,
               -0.155023739,
               0.163546309,
               0.2278542,
               0.0468488149,
               -0.0298284665,
               0.103998393,
               -0.189682931,
               0.13570717,
               -0.0902257,
               0.263276041,
               -0.284640819,
               0.6480951,
               -0.13615,
               0.06460058,
               0.0300964583,
               0.277058423,
               -0.222011819,
               0.1610418,
               -0.239827856,
               -0.224407688,
               -0.01426277,
               0.455224067,
               -0.0142877391,
               -0.197047681,
               -0.2739496,
               0.177227348,
               0.07222182,
               -0.119475842,
               -0.071904555,
               0.109040715,
               -0.175172016,
               -0.08903846,
               0.171700433,
               -0.0595589057,
               0.114024363,
               0.165220618,
               -0.3516052,
               -0.0344811678,
               -0.117401235,
               -0.134139985,
               -0.160115838,
               0.264115065,
               0.108979322,
               -0.08942594,
               -0.17326206,
               -0.0543319769,
               0.0457898937,
               0.08167993,
               0.085113056,
               0.08021274,
               -0.241750732,
               0.372253478,
               -0.100944564,
               -0.156682327,
               0.05091349,
               0.199777648,
               -0.2448919,
               0.134822354,
               0.00219400134,
               -0.0311680827,
               0.121357709,
               -0.126887918,
               -0.189581066,
               0.166673914,
               0.0304716285,
               0.1550452,
               -0.0527370274,
               0.0262714718,
               -0.227457419,
               -0.134373114,
               0.30570212,
               -0.09297785,
               -0.184757546,
               0.3995632,
               -0.221198976,
               0.172162876,
               -0.0296353213,
               0.109970443,
               -0.09030433,
               -0.003445088,
               0.148450509,
               0.05159148,
               0.171005309,
               0.0203911532,
               -0.273741961,
               -0.225818485,
               -0.144992769,
               -0.0502543524,
               0.257335037,
               0.178922385,
               -0.416384131,
               0.02373533,
               -0.17261526,
               -0.510241151,
               0.12343695,
               -0.305918545,
               0.03734532,
               0.192637414,
               0.472671658,
               -0.108742364,
               0.006102426,
               -0.0464581326,
               -0.487040579,
               0.04032278,
               0.0846796557,
               0.513751447,
               -0.06556256,
               0.150308341,
               -0.0401739739,
               -0.21601969,
               0.244901061,
               -0.135021016,
               0.104655653,
               0.719252,
               -0.127151191,
               -0.26400426,
               0.122731969,
               0.003511933,
               -0.62216115,
               0.06386337,
               0.02939668,
               0.336044818,
               -0.0294852,
               0.109024331,
               0.113179624,
               -0.202344418,
               0.242993861,
               0.109087944,
               -0.323201,
               -0.141924933,
               -0.06445199,
               0.1999353,
               0.03344006,
               -0.0118404292,
               0.0231701937,
               0.0324938372,
               0.09918065,
               0.008781714,
               -0.4246516,
               0.127948478,
               0.34636876,
               -0.286242545,
               0.2684635,
               0.209644213,
               -0.191321656,
               0.330553859,
               -0.303500146,
               -0.00259378785,
               -0.125139773,
               0.237631842,
               0.245813653,
               0.200307652,
               -0.112342872,
               -0.252500147,
               -0.113382742,
               -0.3286195,
               -0.213139564,
               -0.0752934739,
               0.38539052,
               -0.236730471,
               0.4138971,
               -0.118504152,
               0.0405057929,
               0.0586808957,
               0.4284022,
               -0.332509458,
               -0.0186376013,
               -0.299636245,
               -0.08990954,
               -0.103889488,
               0.003191851,
               -0.125706881,
               -0.038307786,
               -0.409147471,
               0.0232426077,
               -0.1789084,
               0.3214879,
               -0.255264252,
               0.110983461,
               0.1002271,
               0.128406227,
               0.00308932317,
               0.128380775,
               -0.103031784,
               0.229762822,
               -0.312355161,
               0.14639695,
               0.0518045425,
               0.181075469,
               -0.0762470961,
               0.0160010122,
               -0.2433194,
               0.303687334,
               -0.42612645,
               0.272491932,
               0.0381189026,
               0.0157807581,
               0.315274775,
               -0.0213019289,
               0.04902941,
               -0.01310969,
               0.0690254644,
               0.00600312045,
               -0.1825354,
               0.0897517949,
               0.0288716462,
               -0.0373574,
               0.122740157,
               0.0622048527,
               0.109329514,
               -0.09101811,
               0.169651151,
               -0.323016852,
               -0.141453892,
               0.257460654,
               0.124831937,
               -0.0537066571,
               0.00677632773,
               0.0290810056,
               -0.008327023,
               0.183394939,
               0.0126353158,
               -0.0595417172,
               0.00707559241,
               0.161399961,
               0.0516731367,
               -0.03312039,
               -0.146787554,
               -0.0417942,
               0.02433621,
               -0.0403179824,
               -0.07198493,
               -0.06211192,
               -0.09906856,
               -0.0776062459,
               0.124999151,
               0.05696331,
               0.08771709,
               0.1293044,
               -0.002995093,
               -0.101944387,
               0.0026786516,
               -0.0701336861,
               0.09556461,
               0.156700715,
               0.103964366,
               0.143707588,
               -0.198551208,
               0.200645521,
               -0.2486838,
               0.0177682359,
               0.107132375,
               0.4929284,
               -0.268571019,
               -0.121224239,
               -0.12699841,
               0.0525718927,
               -0.269398928,
               -0.107555293,
               0.197605342,
               0.208466947,
               0.188445732,
               -0.1150398,
               -0.3052914,
               -0.116828136,
               -0.347812563,
               0.5207266,
               -0.471263826,
               -0.2328495,
               0.154628128,
               0.2560245,
               0.1808965,
               -0.3491569,
               -0.0832585,
               -0.08207681,
               0.202580571,
               0.171142,
               -0.176448315,
               -0.173751563,
               0.27033633,
               -0.08097436,
               0.07127182,
               -0.45104757,
               0.0683375746,
               -0.0619989447,
               0.267666817,
               -0.0347461551,
               0.0451328643,
               0.0283331126,
               -0.053918153,
               0.272164166,
               0.120159492,
               -0.05236149,
               0.05582002,
               0.0011276945,
               -0.09788047,
               0.0894252,
               0.24042055,
               -0.166656,
               -0.163508862,
               0.179951519,
               -0.008891127,
               -0.02830039,
               -0.128643692,
               0.0382989831,
               -0.007997912,
               0.4160533,
               -0.206394732,
               -0.1286027,
               0.134379715,
               -0.002044894,
               -0.278767258,
               -0.289558768,
               -0.12267676,
               -0.143306151,
               0.120253973,
               -0.0201101582,
               0.0296755731,
               -0.0327376723,
               0.0853865445,
               -0.00582169462,
               0.276994735,
               -0.09291596,
               0.0407384746,
               -0.06486777,
               0.0673527345,
               -0.407320917,
               0.176787868,
               -0.05011263,
               -0.443518162,
               0.133013979,
               -0.003133329,
               -0.569022238,
               0.353231817,
               -0.15320757,
               0.07206131,
               0.34108296,
               -0.0156700164,
               0.0190370772,
               -0.110051148,
               -0.14040494,
               0.08216294,
               0.315339059,
               0.318229467,
               -0.00225905864,
               0.03296921,
               -0.0736202449,
               -0.231912568,
               0.0828810558,
               0.330503374,
               -0.1170502,
               -0.138654962,
               0.117417887,
               -0.118591547,
               0.243999854,
               0.01046438,
               -0.163042516,
               -0.09938912,
               -0.102057166,
               -0.0355696268,
               -0.19905141,
               0.184923336,
               0.0006553979,
               -0.0110417223,
               -0.04646678,
               0.180755138,
               -0.208112478,
               -0.0106847268,
               0.11008577,
               -0.322029442,
               -0.0550575554,
               0.290914953,
               0.20048213,
               -0.2963689,
               -0.07224384,
               0.191802576,
               -0.483878136,
               0.2876496,
               0.1405518,
               0.2795824,
               -0.0365329646,
               0.0808394253,
               -0.170954511,
               -0.124412276,
               -0.2703731,
               0.3889429,
               -0.350347519,
               -0.09931854,
               0.40855515,
               0.163946718,
               0.234871745,
               -0.08232963,
               -0.233469173,
               0.240824908,
               0.0517646633,
               0.267326325,
               -0.0995833352,
               -0.148120984,
               -0.159102038,
               0.04594075,
               0.118711941,
               -0.243284047,
               -0.1403534,
               0.207647979,
               -0.1845549,
               0.1585957,
               0.12459331,
               -0.0265888236,
               0.050125815,
               0.020598596,
               0.0579010621,
               -0.0643743,
               -0.0155924009,
               0.148606658,
               -0.104682826,
               -0.126433775,
               -0.161236376,
               0.0280199721,
               -0.170076892,
               0.157818854,
               0.120431408,
               -0.164918318,
               0.36278823,
               -0.2666024,
               -0.141668588,
               0.0953483656,
               0.06331297,
               -0.425641239,
               -0.093228206,
               0.06773596,
               0.1038305,
               0.354218632,
               0.0103364205,
               -0.0808855146,
               -0.0506080426,
               -0.2010881,
               0.0213292763,
               0.184008867,
               -0.169328928,
               0.0222773515,
               -0.109801635,
               -0.07443203,
               -0.57504797,
               0.353764653,
               0.12063732,
               0.205476537,
               -0.0321504623,
               0.132418051,
               -0.2364824,
               -0.09282831,
               -0.12945804,
               0.10844548,
               -0.473647475,
               -0.04701531,
               -0.245308086,
               -0.11569868,
               -0.1835617,
               1.186131,
               -0.210268915,
               -0.137194,
               -0.0845148638,
               0.4066081,
               0.168704882,
               0.11400485,
               0.123497218,
               -0.355294168,
               0.191799045,
               -0.185022533,
               0.06558171,
               0.200256571,
               -0.08179304,
               -0.191736728,
               -0.08448341,
               -0.08531129,
               -0.005563742,
               -0.2091682,
               0.08557648,
               0.003214851,
               0.0368523,
               0.0378030054,
               -0.121561907,
               0.104489163,
               0.0234536119,
               -0.110038407,
               0.058686614,
               -0.0554890968,
               -0.003145246,
               -0.09814894,
               0.05643804,
               -0.0831635743,
               -0.0712614357,
               -0.3301129,
               0.21189186,
               -0.0346443653,
               0.191383824,
               0.129926845,
               0.1062365,
               -0.236834884,
               0.10848058,
               -0.3113672,
               0.169692576,
               -0.07752825,
               0.510507,
               0.117747486,
               0.183045968,
               -0.1715136,
               0.21025455,
               -0.298647076,
               0.380120367,
               -0.0129686091,
               0.07246911,
               -0.26793164,
               0.201850027,
               -0.0472067073,
               0.124085672,
               -0.06640108,
               0.06774567,
               -0.0656038,
               0.05614608,
               -0.033377707,
               -0.0461861044,
               -0.11172571,
               -0.00583902653,
               0.0118888794,
               -0.0209865179,
               0.25051105,
               -0.109632559,
               -0.008053852,
               -0.237165019,
               -0.0041796905,
               0.210669428,
               -0.1030085,
               -0.08516135,
               -0.054498177,
               0.1742405,
               0.263459951,
               -0.157053977,
               -0.0134224687,
               -0.134246036,
               0.0172099676,
               0.109916694,
               0.121876419,
               -0.15396069,
               0.119199514,
               0.04004375,
               0.213840887,
               -0.178369164,
               0.08698582,
               -0.249951243,
               -0.0574369654,
               0.04811376,
               -0.0283447169,
               0.03596768,
               -0.0540268235,
               0.0398854762,
               0.193670273,
               -0.08633041,
               0.09535385,
               -0.08077927,
               0.126325577,
               -0.109082788,
               -0.293513745,
               -0.0706641153,
               -0.110342577,
               0.325033635,
               0.1094895,
               -0.04204054,
               0.184639364,
               -0.08788451,
               -0.0512597375,
               0.09163496,
               -0.0731338859,
               -0.107626446,
               0.212733924,
               0.2173582,
               0.08536955,
               -0.241663918,
               0.0155574083,
               0.145947859,
               0.252815217,
               -0.09093688,
               0.15102309,
               -0.04449622,
               0.134434655,
               -0.127738968,
               -0.19595775,
               0.32715,
               -0.370973647,
               -0.3606628,
               0.163902164,
               -0.197979063,
               -0.21479395,
               0.206409365,
               -0.129359052,
               -0.04810766,
               0.11872942,
               -0.008912773,
               0.0672770441,
               -0.23403886,
               0.004117777,
               -0.348540068,
